results-media-harness_2_0_0-run/result-2026-01-05-22:53:43/wrk2_results_20260105_225349.txt
Running 30s test @ http://nginx-web-server:8080
  16 threads and 16 connections
  Thread calibration: mean lat.: 6.892ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 10.866ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 7.309ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 6.779ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 5.881ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 6.213ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 7.073ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 6.382ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 8.094ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 5.249ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.853ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 5.478ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.916ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.802ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.593ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 6.960ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.63ms    1.03ms  13.69ms   68.36%
    Req/Sec    52.65     52.30   111.00     79.80%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.68ms
 75.000%    3.24ms
 90.000%    3.81ms
 99.000%    5.34ms
 99.900%    8.41ms
 99.990%   11.73ms
 99.999%   13.69ms
100.000%   13.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.387     0.000000            1         1.00
       1.246     0.100000         1598         1.11
       1.653     0.200000         3194         1.25
       2.105     0.300000         4794         1.43
       2.441     0.400000         6390         1.67
       2.679     0.500000         7992         2.00
       2.791     0.550000         8790         2.22
       2.901     0.600000         9583         2.50
       3.005     0.650000        10382         2.86
       3.121     0.700000        11179         3.33
       3.245     0.750000        11978         4.00
       3.311     0.775000        12381         4.44
       3.387     0.800000        12776         5.00
       3.463     0.825000        13174         5.71
       3.579     0.850000        13579         6.67
       3.693     0.875000        13975         8.00
       3.753     0.887500        14175         8.89
       3.813     0.900000        14371        10.00
       3.877     0.912500        14572        11.43
       3.963     0.925000        14772        13.33
       4.073     0.937500        14970        16.00
       4.143     0.943750        15073        17.78
       4.219     0.950000        15172        20.00
       4.307     0.956250        15269        22.86
       4.395     0.962500        15373        26.67
       4.507     0.968750        15470        32.00
       4.571     0.971875        15519        35.56
       4.663     0.975000        15570        40.00
       4.751     0.978125        15618        45.71
       4.831     0.981250        15670        53.33
       4.967     0.984375        15719        64.00
       5.043     0.985938        15744        71.11
       5.135     0.987500        15768        80.00
       5.243     0.989062        15793        91.43
       5.439     0.990625        15818       106.67
       5.639     0.992188        15843       128.00
       5.739     0.992969        15855       142.22
       5.859     0.993750        15869       160.00
       6.031     0.994531        15880       182.86
       6.235     0.995313        15893       213.33
       6.363     0.996094        15905       256.00
       6.443     0.996484        15911       284.44
       6.551     0.996875        15918       320.00
       6.883     0.997266        15924       365.71
       7.115     0.997656        15930       426.67
       7.279     0.998047        15936       512.00
       7.583     0.998242        15940       568.89
       7.675     0.998437        15943       640.00
       8.035     0.998633        15946       731.43
       8.335     0.998828        15949       853.33
       8.447     0.999023        15952      1024.00
       8.631     0.999121        15953      1137.78
       8.815     0.999219        15955      1280.00
       9.127     0.999316        15957      1462.86
       9.287     0.999414        15958      1706.67
       9.575     0.999512        15960      2048.00
       9.575     0.999561        15960      2275.56
      10.487     0.999609        15961      2560.00
      10.751     0.999658        15962      2925.71
      10.895     0.999707        15963      3413.33
      11.215     0.999756        15964      4096.00
      11.215     0.999780        15964      4551.11
      11.215     0.999805        15964      5120.00
      11.735     0.999829        15965      5851.43
      11.735     0.999854        15965      6826.67
      12.711     0.999878        15966      8192.00
      12.711     0.999890        15966      9102.22
      12.711     0.999902        15966     10240.00
      12.711     0.999915        15966     11702.86
      12.711     0.999927        15966     13653.33
      13.695     0.999939        15967     16384.00
      13.695     1.000000        15967          inf
#[Mean    =        2.628, StdDeviation   =        1.032]
#[Max     =       13.688, Total count    =        15967]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  23999 requests in 29.96s, 7.92MB read
  Non-2xx or 3xx responses: 22491
Requests/sec:    801.14
Transfer/sec:    270.80KB

--- RESPONSE STATUS HISTOGRAM ---
Total requests: 23999
Total errors (4xx/5xx): 22491
Threads aggregated: 16

Status code distribution:
  200:     1508 (  6.28%) ███
  500:    22491 ( 93.72%) ██████████████████████████████████████████████

Histogram data written to: /wrktemp/results/response_histogram.json